content/posts/contenedores.html
---
layout: post
title: Contenedores en C++
date: 2020-01-30
author: nsm
email: nsm.aprox@gmail.com
---
<script src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML" type="text/javascript"></script>

<p>
Los contenedores sirven para guardar secuencias de objetos. Si no
tuvieramos contenedores, tendríamos que recordar el lugar de cada uno
para cada vez que necesitamos usarlo. En cambio, podemos usar una
colección y sólo recordar el lugar donde está ella. Esto implica, sin
embargo, que entonces haya que tener que buscarlo dentro de ese
contenedor cuando lo necesitemos. Pero eso es mejor a tener que anotar
dónde está cada cosa. Perderíamos mucho tiempo pensando qué nombres
poner a las variables, y los de muchas de ellas serían necesariamente
malos, o estarían numeradas por ejemplo, etc.
</p>

<p>
Pero hay otra ventaja que trae el uso de los contedores. Una vez que
agrupamos lo objetos en una colección pensamos en la colección misma y
simplificamos los problemas. Supongamos que queremos averiguar el
promedio de una cierta cantidad de mediciones. Sin un contenedor que
las agrupe tendíamos que hacerlo a mano: escribir algo como:
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="font-weight: bold; text-decoration: underline;">double</span> <span style="font-weight: bold; font-style: italic;">sum</span> = x1 + x2 + x3 + x4 <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">...</span>
<span style="font-weight: bold; text-decoration: underline;">double</span> mean = sum / N;
</pre>
</div>

<p>
y esto siempre que la cantidad de variables no se demasiado
grande. Además ¿de dónde sacamos <code>N</code>? La tuvimos que calcular a mano
(al numerar las variables).
</p>

<p>
Entonces, podemos hacer algo como 
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="font-weight: bold; text-decoration: underline;">double</span> <span style="font-weight: bold; font-style: italic;">mean</span> = <span style="font-weight: bold; text-decoration: underline;">std</span>::acumulate(x.begin(), x.end(), 0, <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">plus</span>&lt;<span style="font-weight: bold; text-decoration: underline;">double</span>&gt;{}) / x.size();
</pre>
</div>

<p>
Quizá para alguno no muy acostumbrado a c++ esto pueda parecer un poco
verborrágico. En un lenguaje como R, por ejemplo, sólo hacía falta
escribir
</p>

<div class="org-src-container">
<pre class="src src-R">resutl = mean(x)
</pre>
</div>

<p>
Bueno, la comparación quizá no sea válida, porque nadie va a pretender
que c++ tenga definida la función <code>mean</code> en su <code>namespace</code>
global ni en <code>std</code>. Pero en R también podemos hacer eso:
</p>

<div class="org-src-container">
<pre class="src src-R">mean = Reduce("+",x,0) / length(x)
</pre>
</div>

<p>
Estas dos funciones, <code>Reduce</code> y <a href="https://es.cppreference.com/w/cpp/algorithm/accumulate"><code>std::accumulate</code></a> son bastante
parecidas (hay una función <a href="https://en.cppreference.com/w/cpp/algorithm/reduce"><code>std::reduce</code></a>, pero parece no estar
soportada en todas las implementaciones todavía). La idea es que
tenemos una colección, una operación binaria y un valor inicial. Esta
operación binaria es una función uno de cuyos parámetros es del tipo
de los elementos de la colección, mientras que el otro tiene que ser
del mismo tipo que su resultado (puede ser cualquier tipo), incluyendo
(como en este ejemplo) el tipo de los elementos de la colección.
</p>

<p>
En este caso particular la operación es la suma, o sea que los
parámetros son ambos del mismo tipo, y el resultado también. La
diferencia más importante es la forma en que se indica la
colección. En c++ le decimos no la colección sino un rango dentro de
la colección (en este ejemplo es el rango con todos los
elementos). Pero esto es bueno, porque entonces puede usarse para
casos en los que sólo queremos aplicarle una función a una parte.
</p>

<p>
Tal vez alguno prefiera calcular la media de un forma distinta, por
ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="font-weight: bold;">decltype</span> (x)::<span style="font-weight: bold; text-decoration: underline;">value_type</span> <span style="font-weight: bold; font-style: italic;">sum</span>{};
<span style="font-weight: bold;">for</span> (<span style="font-weight: bold;">const</span> <span style="font-weight: bold;">auto</span>&amp; <span style="font-weight: bold; font-style: italic;">elem</span>: x) { sum += x; }
<span style="font-weight: bold;">auto</span> <span style="font-weight: bold; font-style: italic;">result</span> = sum / x.size(); 
</pre>
</div>

<p>
Pero en ese caso, por un lado, tenemos que escribir más y por otro
dejamos de aprovechar la posibilidad que nos da <code>reduce</code> (o
<code>accumulate</code>) de pensar dirctamente en la colección, y volvemos a
mirar los elementos y operardirectamente sobre ellos. Por último, es
más fácil equivocarnos también si volvemos a escribir para estos
parámetros en particular lo que ya está hecho en forma más general en
<code>accumulate</code>.  
</p>

<p>
Otra cosa que en este ejemplo vemos (y que está en cada una de las
versiones que vimos) es que no tenemos que "perder" tiempo buscando
ninguno de los datos, porque de todas formas íbamos a tener que verlos
todos. O sea que acá, no sólo el contenedor nos sirve para calcular la
cantidad de datos que hay, sino que además no trae aparejado un
"costo" mayor, como sí el caso en que, por ejemplo, queremos saber si
está tal o cual medición. Pero en ese caso, como dije antes,
tendríamos que usar nuestra propia memoria!  (en lugar de la de la
computadora).
</p>

<p>
Ahora veamos cuál es el contenedor más simple (si es que llega a ser
contenedor) que hay en C++. Digo "si llega a ser" porque, como vamos a
ver, le faltan algunas cosas,  (lo cual es sufuciente por otra parte
como para que siempre preferamos usar otro contenedor)
</p>


<p>
Estoy hablando del arreglo (un <i>built-in array</i>), que se define,
dado un tipo <code>T</code> y un entero <code>N</code>, así:
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="font-weight: bold; text-decoration: underline;">T</span> <span style="font-weight: bold; font-style: italic;">x</span>[N]{};
</pre>
</div>

<p>
Un problema que puede aparecer con el array tiene que ver con saber
cuantos elementos contiene, es decir, cuál es el valor de <code>N</code>. Si
estamos escribiendo una función y declaramos un array, entonces
sabemos qué tamaño tiene, porque lo tuvimos que decir al hacerlo (es
el valor de <code>N</code>, que no es una variable si no un número
constante). Ahora supongamos que en esta función que estamos
escribiendo nos fijamos, como parte de lo que tenemos que hacer y para
distintas posiciones, si el valor ahí es mayor estricto que el
anterior y el posterio o menor estricto también que ambos. Para hacer
eso podríamos hacer al como
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="font-weight: bold; text-decoration: underline;">size_t</span> <span style="font-weight: bold; font-style: italic;">position</span> = <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">... la posici&#243;n que sea.</span>
<span style="font-weight: bold; text-decoration: underline;">bool</span> is_local_extremum = x[position - 1] &lt; x[position] &amp;&amp; x[position] &lt; x[position + 1];
<span style="font-weight: bold;">if</span> (is_local_extremum) {
   <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">...</span>
} <span style="font-weight: bold;">else</span> {
   <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">..</span>
}
</pre>
</div>

<p>
Es importante notar que para hacer esto en necesario que <code>position &gt;=
1</code> y además que <code>position &lt; N - 1</code>. Y eso lo sabemos porque nosotros
mismos escribimos el valor de <code>position</code> así como el de <code>N</code>. Incluso
en este caso (demasiado simple), nosotros mismos podríamos
equivocarnos y poner valores de <code>position</code> y de <code>N</code> que no sean
correctos &#x2026;
</p>

<p>
Pero ya vemos motivos para definir una función que haga esto. Primero,
que si lo vamos a usar muchas veces, entonces para qué escribir todo
de nuego cada vez y no, en cambio, escribir algo para poder
directamente hacer:
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="font-weight: bold;">if</span> (is_local_extremum(x, position)) { <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">...</span>
</pre>
</div>

<p>
Y hay otro motivo también. Si bien elejimos el nombre de la variable
booleana del primer ejemplo para que se vea fácil qué estamos
haciando, y esto hace que se vea a simple vista, podríamos poner
ejemplo que ocupe algunas líneas más donde resulte más confuso y no se
arregle nombrando una variable. En todo caso, a lo que voy es que con
una función le damos un nombre a lo que hace un bloque de código y eso
hace que quien lo lee (otra persona o uno mismo en unos días) no
necesite estar calculando qué hacen las líneas para tener una idea de,
al menos, lo que debería estar haciendo ese bloque.
</p>

<p>
Muy bien, escribamos nuestra función. Lo primero que tenemos que hacer
es pensar en la "signature", es decir, que valor va a devolver (o
"tener") y que parámetros va a recibir. Bueno, devolver va a de volver
un bool. El problema está en el primer parámetro, el arreglo (para
ver esto era todo este rodeo). Supongamos (para que sea más claro) que
N es 4. Una opción podría ser:
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="font-weight: bold; text-decoration: underline;">bool</span> <span style="font-weight: bold;">is_local_extremum</span>(<span style="font-weight: bold;">const</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">x</span>[4], <span style="font-weight: bold; text-decoration: underline;">size_t</span> <span style="font-weight: bold; font-style: italic;">position</span>);
</pre>
</div>

<p>
Esto es una opción. Pero el problema que tiene es que podría ser más
general y no lo es. Si alguien quisiera hacer esto con
arreglos de otro tamaño que no sea <code>4</code> tendría que hacer un versión
distinta. Y aparece un nuevo problema: si ya no sé el tamaño del
arreglo entonces no puedo chequear el la posición que me pasan no está
fueera del rango.
</p>

<p>
Acá es cuando empezamos a ver que es mejor usar otro tipo de
dato. Porque no es buena idea pasar un puntero sin sin decir el
tamaño. Es decir, si hacemos
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="font-weight: bold; text-decoration: underline;">bool</span> <span style="font-weight: bold;">is_local_extremum</span>(<span style="font-weight: bold;">const</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">x</span>[], <span style="font-weight: bold; text-decoration: underline;">size_t</span> <span style="font-weight: bold; font-style: italic;">position</span>);
</pre>
</div>

<p>
o
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="font-weight: bold; text-decoration: underline;">bool</span> <span style="font-weight: bold;">is_local_extremum</span>(<span style="font-weight: bold;">const</span> <span style="font-weight: bold; text-decoration: underline;">int</span>* <span style="font-weight: bold; font-style: italic;">x</span>, <span style="font-weight: bold; text-decoration: underline;">size_t</span> <span style="font-weight: bold; font-style: italic;">position</span>);
</pre>
</div>

<p>
Entonces adentro de nuestra función no vamos a poder chequear
nunca. Tenemos la opción de confiar en que el usuario de nuestra
función nunca va a cometer el error de pasar una posión
incorrecta. Pero eso no sirve, porque igualmente eso puede pasar, por
más que confiemos en que no. Si simplemente nos lavamos las manos ya
hacemos <code>x[n]</code>, cuando alguien pase una posición incorrecta el
programa va a tener una conducta indefinida. Y quizá resulte, para
cuando ocurra, dificil de averiguar qué está pasando, porque nadie va
a estar pensando en esta función. Quizá algún usuario de nuestra
función también confió en el de la suya, y así.
</p>

<p>
Entonces tenemos (al menos) dos formas de obtener el tamaño del
arreglo. Una es pedirlo directamente:
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="font-weight: bold; text-decoration: underline;">bool</span> <span style="font-weight: bold;">is_local_extremum</span>(<span style="font-weight: bold;">const</span> <span style="font-weight: bold; text-decoration: underline;">int</span>* <span style="font-weight: bold; font-style: italic;">x</span>, <span style="font-weight: bold; text-decoration: underline;">size_t</span> <span style="font-weight: bold; font-style: italic;">position</span>, <span style="font-weight: bold; text-decoration: underline;">size_t</span> <span style="font-weight: bold; font-style: italic;">x_size</span>);
</pre>
</div>

<p>
Acá le estamos dando una poco más de trabajo a nuestro cliente: cada
que que use la función tiene que, además, pasar ese valor. No es tan
grave, pero igual hay un problema, que sí lo es: también se puede
equivocar. ¿Qué pasa si el valor que pasa de <code>x_size</code> es incorrecto?
Estamos en la misma.
</p>

<p>
Podemos entonces hace algo mejor:
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="font-weight: bold;">template</span>&lt;<span style="font-weight: bold; text-decoration: underline;">size_t</span> <span style="font-weight: bold; font-style: italic;">N</span>&gt;
<span style="font-weight: bold; text-decoration: underline;">bool</span> <span style="font-weight: bold;">is_local_extremum</span>(<span style="font-weight: bold;">const</span> <span style="font-weight: bold; text-decoration: underline;">int</span> (&amp;<span style="font-weight: bold; font-style: italic;">x</span>)[N], <span style="font-weight: bold; text-decoration: underline;">size_t</span> <span style="font-weight: bold; font-style: italic;">position</span>);
</pre>
</div>

<p>
Este template va a generar todas las funciones que sean necesarias
cuando se compile el código (es decir, si se la usa con un tipo <code>T</code>,
entonces se va a generar una para el tipo <code>T</code>, si no, no). Y así
rápidamente alguno va a decir ¿pero porque restringir el tipo del
array en el template y no hacerlo parámetro también? Y así escribe:
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="font-weight: bold;">template</span>&lt;<span style="font-weight: bold;">typename</span> <span style="font-weight: bold; text-decoration: underline;">T</span>,<span style="font-weight: bold; text-decoration: underline;">size_t</span> <span style="font-weight: bold; font-style: italic;">N</span>&gt;
<span style="font-weight: bold; text-decoration: underline;">bool</span> <span style="font-weight: bold;">is_local_extremum</span>(<span style="font-weight: bold;">const</span> <span style="font-weight: bold; text-decoration: underline;">T</span> (&amp;<span style="font-weight: bold; font-style: italic;">x</span>)[N], <span style="font-weight: bold; text-decoration: underline;">size_t</span> <span style="font-weight: bold; font-style: italic;">position</span>);
</pre>
</div>

<p>
Esto sirve para <code>int</code>, pero también para <code>short</code>, <code>long</code>, <code>float</code>,
<code>double</code>, etc. Esto ya parece estar bastante bien. Pero de todas
formas podría mejorar: podríamos usar <a href="https://en.cppreference.com/w/cpp/container/array"><code>std::array</code></a> en vez de una
arreglo común y silvestre. Con esto básicamente accedemos a varias
"funcionalidades" que están ya provistas en la stl. En particular,
tenemos el método <code>at</code> que accede al enésimo elemento pero tirando una
excepción <a href="https://es.cppreference.com/w/cpp/error/out_of_range"><code>std::out_of_range</code></a> si la posión pedida está fuera del
rango. Yo creo que esto está muy bien porque si alguien pide una
posición fuera del rango algo anda mal y hay que arreglar eso.
</p>

<p>
Pero pasemos a otro problema: ¿qué pasa si nuestra colección tiene un
tamaño que no podemos conocer mientras estamos escribiendo el
programa?
</p>

<p>
O sea, supongamos que nuestro programa lee de un archivo que provee un
usuario los datos, y que la cantidad que haya varie (es decir, no
queremos pedirle a nuestro cliente que su archivo tiene que tener una
cantidad fija de datos como para que sirva el programa). En este caso
se dice que el tamaño del arreglo no se conoce en tiempo de
compilación sino en tiempo de ejecución.
</p>

<p>
Una (mala) opción es la siguiente:
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="font-weight: bold; text-decoration: underline;">T</span>* <span style="font-weight: bold; font-style: italic;">x</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">T</span>[N]{};
<span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">...</span>
<span style="font-weight: bold;">delete</span>[] x;
</pre>
</div>

<p>
Nótese que tuvimos que agregar el <code>delete[]</code> al final. Esto porque en
lugar de ubicarse en la <code>stack</code> como los ejemplos anteriores, <code>new</code> le
pide memoria al sistema oerativo que se reserva en el <code>heap</code>. la stack
es una porción de memoria que es propia de una función, una vez que
hacemos <code>return</code> se libera toda la memoria que la función había
reservado en la stack. La memoria del heap, en cambio, no. Una función
reserva memoria en el heap, y una retorna esa memoria sigue
reservada. Si esa función no hace <code>delete[]</code> (o si no le pasa el
puntero a otra función ara que lo haga) entonces esa memoria queda
reservada inutilmente durante toda la vida del programa. Esto es un
problema. Pero a veces necesitamos pedir memoria del heap: supongamos
que necesitamos un arreglo muy grande. Hay casos en los que el arreglo
es muy grande para la stack pero podemos usar el heap
tranquilamente. Y el otro caso, bastante frecuente, es que a veces
queremos que la vida de los objetos no esté limitada a la stack de la
función en la que los creamos. En ese caso vamos a preferir el heap y
no andar copiándolo cada vez que pasamo de una función a otra.
</p>


<p>
Para esto la stl provee una cantidad de distintos contenedores, el
probablemente mas usado es el <a href="https://es.cppreference.com/w/cpp/container/vector"><code>std::vector</code></a>:
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">vector</span> <span style="font-weight: bold;">x</span>(N);
</pre>
</div>

<p>
El <code>vector</code> guarda su selementos en forma contigua. Esto permite
acceso aleatorio en (en \(O(1)\)) (usando <code>at</code> o <code>operator[]</code>, lo bueno
de <code>at</code> es que chequea que en índice esté dentro del vector). Además,
su tamaño se puede modificar en <i>runtime</i> (son <code>resize</code>), con lo que
puede usarse para los casos en no sabemos qué cantidad de elementos
vamo sa tener que guardar de antemano. Con <code>push_back</code> podemos
insertar un elemento al final de forma eficiente (\(O(1)\)
amortizado). Amotizado significa que al hacer <code>push_back</code> no
necesariamente sea \(O(1)\). Lo es si la capacidad del vector es mayor a
su tamaño. Entonces sería similar a usar <code>at</code>. Pero si ya no hay
capacidad para agregar, entones no queda otra que pedir más
memoria. pero no sólo hay que pedir más memoria. Como los elementos se
guardan en forma contigua, entonces necesitamos pedir memoria para que
entren los objetos guardados, más el nuevo, y copiar todo ahí y
finalmente liberar la memoria donde estaban anteriorente. Todo eso es
\(O(n)\). Pero es "amortizado" porque esto no ocurre siempre. Cada vez
que se colma la capacidad, el arreglo subyascente se duplica, de
forma tal que cada \(n\) inserciones seguidas estaríamos haciéndo esto
\(\log_2{n}\) veces. Otra opción es usar <code>reserve</code> de forma tal de
aumentar la capacidad y así reducir la cantidad de veces que se pide
más memoria.
</p>

<p>
También permite abstraer el manejo de la memoria (o sea, no hay que
hacer <code>delete</code>). ¿Cómo evitamos hacer delete? Bueno, cuando el
<code>vector</code> queda fuera del scope se destruye y con eso se liberan los
recursos que manejaba, es decir, la memoria que había reservado del
heap. Por ejemplo, si hacemos <code>return</code> de una función donde habíamos
declarado el <code>vector</code>, entonces se lo destruye.
</p>

<p>
Por último, el vector permite que volvamos de una función y que sea
accesible desde la función que la llamó. Básicamente lo que podemos
hacer es devolver el vector: <code>std::vector&lt;T&gt; foo();</code>. Esto va a hacer
que el vector se construya directamente en el <i>scope</i> de la función
que llama a <code>foo()</code> y no dentro de <code>foo()</code> (por más que dentro de
<code>foo()</code> se loa declare inicialmente). Ver <a href="https://es.cppreference.com/w/cpp/language/copy_elision">copy elision</a>
</p>

<p>
Tanto los arreglos <i>bulit-int</i> como los <code>std::array</code> como los
<code>std::vector</code> usan memoria contigua. Existen sin embargo otros
contenedores que no. Por ejemplo, hay contenedores que se basan en
nodos y que sus elementos pueden estar ubicados en distintas partes de
la memoria en forma no contigua. Esto puede ser una ventaja o
desventaja, según el caso. Por ejemplo, para insertar al principio de
un contenedor de memoria contigua hay que mover todos los demás, con
lo que resulta una operación \(O(n)\). En cambio, en una lista enlazada
es \(O(1)\) porque es sólo cuestión de crear un nodo y actualizar los
punteros para insertarlo en la posición que sea. Entre los
contenedores de este tipo se incluyen <a href="https://es.cppreference.com/w/cpp/container/list"><code>std::list</code></a> (double linked) y
<a href="https://es.cppreference.com/w/cpp/container/forward_list"><code>std::forward_list</code></a> (singly-linked), <a href="https://es.cppreference.com/w/cpp/container/deque"><code>std::deque</code></a>, <a href="https://es.cppreference.com/w/cpp/container/set"><code>std::set</code></a> y
<a href="https://es.cppreference.com/w/cpp/container/map"><code>std::map</code></a>.
</p>


<p>
Algunos de estos contenedores son además <i>asociativos</i> como map y
set, mientras que otros (deque, forward<sub>list</sub> y list) secuenciales
(como vector, array y string). Un contenedor es <b>asociativo</b> si es
ordenado y además permite buscar rápidamente una clave.
</p>

<p>
Además hay vectores asociativos como unordered<sub>map</sub> que no
se basa en nodos. Cuando por ejemplo uno busca por un elemento en un
<code>map</code>, lo que hace es recorrer una arbol de búsqueda balanceado
comparando \(O(log(n))\) veces, mientras que al buscar en un
<code>unordered_map</code> se aplica una función de hash para usar ese resultado
para indexar en \(O(1)\) en una tabla (si la función de hash es buena).
</p>

<p>
<code>std::map</code> se usa como un diccionario. Dados los tipos <code>T,U</code>, definimos
un <code>map</code> asi:
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">map</span>&lt;T,U&gt; <span style="font-weight: bold; font-style: italic;">d</span>;
</pre>
</div>


<p>
<code>map</code> tiene el operador <code>[]</code> que permite tando definir una clave como
accederla. Sin embargo, si una valor \(k\) no está definido en \(d\),
entonces <code>d[k]</code> va a definirlo y asociarlo con el valor por defecto del
tipo correspondiente (<code>U{}</code> en este ejemplo). Podemos en cambio usar <code>at</code>
para tirar una excepción si la clave no está definida. O, si queremos
preguntar a ver si está usamos:
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="font-weight: bold;">auto</span> <span style="font-weight: bold; font-style: italic;">key</span> = T{};
<span style="font-weight: bold;">auto</span> <span style="font-weight: bold; font-style: italic;">it</span> = d.find(key);
<span style="font-weight: bold;">if</span> (it != d.end()) {
   <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">clave encontrada ...</span>
} <span style="font-weight: bold;">else</span> {
  <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">clave no encontrada ...</span>
}
</pre>
</div>


<p>
<code>std::map&lt;T,U&gt;::find</code> devuelve un iterador que apunta a un par clave
valor, de modo que para acceder a estos tenemos que hacer:
</p>

<div class="org-src-container">
<pre class="src src-c++">it-&gt;first; <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">clave</span>
it-&gt;second <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">valor</span>
</pre>
</div>

<p>
Un <code>std::set</code> es como un map pero sin valores. También
existen los contenedores <a href="https://es.cppreference.com/w/cpp/container/multiset"><code>std::multiset</code></a> y <a href="https://es.cppreference.com/w/cpp/container/multimap"><code>std::multimap</code></a> que permiten
guardar más de una clave equivalente.
</p>

<p>
Por último, podemos mencionar además los <i>container adaptors</i> que son
contenedores que tiene una interfaz típicamente más restrigida, pero
adecuada a alguna aplicación en particular: <code>std::stack</code>, <code>std::queue</code>
y <code>std::priority_queue</code>.
</p>
